snlkuharlocal/src/ExchangePlans/ФР_ОбменСФРК/ФР_ОбменСФРК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="0a9b8753-054f-41ea-b5c5-fb8e018ab0a4">
  <name>ФР_ОбменСФРК</name>
  <attributes>
    <name>АдресОчереди</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУзла</name>
    <type>
      <types>EnumRef.ТипУзлаИБ</types>
    </type>
  </attributes>
</mdclass:ExchangePlan>

snlkuharlocal/src/Documents/РекламационнаяНакладная/РекламационнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РекламационнаяНакладная</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.АктПриемки</basedOn>
  <basedOn>Document.ЗаявкаНаРекламацию</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиТМЦКомиссия</registerRecords>
  <registerRecords>AccumulationRegister.Профит</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТМЦ</registerRecords>
  <registerRecords>AccumulationRegister.РасхожденияПоАкту</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.АктПриемки</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРекламации</name>
    <type>
      <types>CatalogRef.ПричиныРекламаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьПоОстаткам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРекламации</name>
    <type>
      <types>EnumRef.ВидыРекламаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервичнаяПриемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВРНК</name>
    <type>
      <types>EnumRef.УчитыватьВРНК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВозврата</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСкидкиДС</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСкидкиДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладКомиссия</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКомиссия</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПретензияПолучателя</name>
    <type>
      <types>DocumentRef.ПретензияПолучателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаВозвратОтПокупателя</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРекламацию</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРекламацию</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсх</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <comment>Скидка %</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Акция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПретензии</name>
      <comment>КодНоменклатуры+НомерСтроки документа ПретензияПокупателя (для вывода причин рекламаций)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРекламации</name>
      <type>
        <types>CatalogRef.ПричиныРекламаций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШКМаркиКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУКонтрагента</name>
      <type>
        <types>EnumRef.СтатусыМарокУКонтаргента</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>количество штук в маркировке (короб это или штука)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/ExchangePlans/ФР_ОбменСФРК/ManagerModule.bsl
Функция ТипУчавствуетВОбмене(Тип) Экспорт
	Возврат ФР_ОбщегоНазначения_ПИ.ТипУчавствуетВОбмене(Тип);	
КонецФункции //ТипУчавствуетВОбмене(Тип)

Функция Узел_ФранчБаза() Экспорт
	ЭтотУзелКод	= ПланыОбмена.Основной.ЭтотУзел().Код;
	
	Если ЭтотУзелКод="SNL" Тогда //Это база ЦО
		ПО_Менеджер	= ПланыОбмена.ФР_ОбменСФРК;
		ЭтотУзел	= ПО_Менеджер.ЭтотУзел();
		Результат	= ПО_Менеджер.ПустаяСсылка();
		
		Выборка	= ПланыОбмена.ФР_ОбменСФРК.Выбрать();	
		Пока Выборка.Следующий() Цикл
			Если НЕ Выборка.ПометкаУдаления И Выборка.Ссылка <> ЭтотУзел Тогда 
				Результат = Выборка.Ссылка;
				Прервать;		
			КонецЕсли; 			
		КонецЦикла;		
	Иначе //Если вдруг прямая выгрузка из периферийной базы ЕЕ
		Результат=ПланыОбмена.ФР_ОбменСФРК.ЭтотУзел();
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //Узел_ФранчБаза()

Функция СписокТиповСверхуВниз() Экспорт
	Результат		= Новый Соответствие;
	ИсключаемыеТипы	= ИсключаемыеТипыСверхуВниз();
	
	ММ	= Новый Массив;
	ММ.Добавить(Документы.БлокировкаАкции);
	ММ.Добавить(Документы.ЗаказПоставщику);
	ММ.Добавить(Документы.ПрайсЛист);
	ММ.Добавить(Документы.ПриходнаяНакладная);
	ММ.Добавить(Документы.РекламационнаяНакладная);
	ММ.Добавить(Документы.СверкаДанных);	
	ММ.Добавить(Документы.УстановкаСкидок);	
	
	//Справочники - все кроме Пользователи...... 	
	Для Каждого МетаОбъект Из Метаданные.Справочники Цикл		
		Если ИсключаемыеТипы.Получить(МетаОбъект.ПолноеИмя())=Неопределено Тогда
			ММ.Добавить(Справочники[МетаОбъект.Имя]);		
		КонецЕсли; 	
	КонецЦикла;	
	
	ММ.Добавить(ПланыВидовХарактеристик.СвойстваОбъектов);
	
	Для Каждого Менеджер Из ММ Цикл
		Результат.Вставить(ФР_ОбщегоНазначения_ПИ.ИмяТипаПоМенеджеру(ЗначениеВСтрокуВнутр(Менеджер)),Истина);	
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции //СписокТиповСверхуВниз()

Функция СписокТиповСнизуВверх() Экспорт
	Результат		= Новый Соответствие;
	ИсключаемыеТипы	= ИсключаемыеТипыСнизуВверх();
	
	ММ	= Новый Массив;
	
	//Документы - Все кроме прайсов
	Для Каждого МетаДок Из Метаданные.Документы Цикл		
		Если ИсключаемыеТипы.Получить(МетаДок.ПолноеИмя())=Неопределено Тогда
			ММ.Добавить(Документы[МетаДок.Имя]);		
		КонецЕсли; 	
	КонецЦикла;
	
	//Справочники - только ПодарочныеСертификаты,Пользователи,ФизическиеЛица...... 	
	ММ.Добавить(Справочники.ПодарочныеСертификаты);
	ММ.Добавить(Справочники.Пользователи);
	ММ.Добавить(Справочники.ФизическиеЛица);
	
	Для Каждого Менеджер Из ММ Цикл
		Результат.Вставить(ФР_ОбщегоНазначения_ПИ.ИмяТипаПоМенеджеру(ЗначениеВСтрокуВнутр(Менеджер)),Истина);	
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции //СписокТиповСнизуВверх()

Функция СписокТиповСверхуВнизДляСтарыхУзлов() Экспорт
	Результат		= Новый Соответствие;
	ИсключаемыеТипы	= ИсключаемыеТипыСверхуВниз();
	
	ММ	= Новый Массив;
	ММ.Добавить(Документы.ЗаказПоставщику);	
	ММ.Добавить(Документы.Инвентаризация);
	ММ.Добавить(Документы.ОприходованиеТМЦ);
	ММ.Добавить(Документы.ОтчетКассовойСмены);	
	ММ.Добавить(Документы.ПереводСредств);
	ММ.Добавить(Документы.Перемещение);
	ММ.Добавить(Документы.ПрайсЛист);
	ММ.Добавить(Документы.ПриходнаяНакладная);
	ММ.Добавить(Документы.РасходнаяНакладная);	
	ММ.Добавить(Документы.СписаниеТМЦ);	
	ММ.Добавить(Документы.УстановкаСкидок);	
	ММ.Добавить(Документы.ЭмиссияПодарочныхСертификатов);	
	
	//Справочники - все кроме Пользователи...... 	
	Для Каждого МетаОбъект Из Метаданные.Справочники Цикл		
		Если ИсключаемыеТипы.Получить(МетаОбъект.ПолноеИмя())=Неопределено Тогда
			ММ.Добавить(Справочники[МетаОбъект.Имя]);		
		КонецЕсли; 	
	КонецЦикла;	
	
	ММ.Добавить(ПланыВидовХарактеристик.СвойстваОбъектов);
	
	Для Каждого Менеджер Из ММ Цикл
		Результат.Вставить(ФР_ОбщегоНазначения_ПИ.ИмяТипаПоМенеджеру(ЗначениеВСтрокуВнутр(Менеджер)),Истина);	
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции //СписокТиповСверхуВниз()

Функция СписокТиповТудаСюда() Экспорт
	Результат		= Новый Соответствие;	
	
	ММ=Новый Массив;
	
	////Документы - почти ничего
	ММ.Добавить(Документы.ЗаказПоставщику);
	ММ.Добавить(Документы.ЗаявкаНаВозвратОтПокупателя);	
	ММ.Добавить(Документы.ХранилищеКодовМаркировки);
	
	//+ HELP-5737 20250708 Михайловский
	//ММ.Добавить(Документы.МаркировкаОстатковТЦ);
	//- HELP-5737 20250708 Михайловский
	
	//+HELP-2306 20250220 Михайловский
	ММ.Добавить(Документы.ЗаявкаНаПостСторонАссорт);
	//-HELP-2306 20250220 Михайловский
	Для Каждого Менеджер Из ММ Цикл
		Результат.Вставить(ФР_ОбщегоНазначения_ПИ.ИмяТипаПоМенеджеру(ЗначениеВСтрокуВнутр(Менеджер)),Истина);	
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции //СписокТиповСнизуВверх()

Функция ИсключаемыеТипыСнизуВверх()
	МТ=Новый Массив;
	
	МТ.Добавить(Документы.ПрайсЛист);
	МТ.Добавить(Документы.УстановкаСкидок);
	
	Возврат МТ_ВСоответствие(МТ);
КонецФункции //ИсключаемыеТипыСнизуВверх()

Функция ИсключаемыеТипыСверхуВниз()
	МТ=Новый Массив;
	
	МТ.Добавить(Справочники.Пользователи);
	МТ.Добавить(Справочники.ПодарочныеСертификаты);
	//МТ.Добавить(Документы.ОтчетКассовойСмены);
	//МТ.Добавить(Документы.СписаниеТМЦ);
	//МТ.Добавить(Документы.ОприходованиеТМЦ);
	
	Возврат МТ_ВСоответствие(МТ);
КонецФункции //ИсключаемыеТипыСверхуВниз()
 
        
Функция МТ_ВСоответствие(МТ,Значение=Истина) 
	Результат = Новый Соответствие;
	Для Каждого Менеджер Из МТ Цикл
		Результат.Вставить(ФР_ОбщегоНазначения_ПИ.ИмяТипаПоМенеджеру(ЗначениеВстрокувнутр(Менеджер)),Значение);	
	КонецЦикла; 
	
	Возврат Результат;
КонецФункции //МТ_ВСоответствие(МТ)
